#List attachments received:
EmailAttachmentInfo
| where FileName endswith ".html" or FileName endswith ".htm"


#exclude email sent from your domain:
EmailAttachmentInfo
| where FileName endswith ".html" or FileName endswith ".htm"
| where SenderFromAddress !contains "@your_domain.here"
